In [28]:
import pandas as pd
data=pd.read_csv("practice2.csv")
print(data)

     EMP_ID     name   age  gender  sallary   city
0    EMP001   vikash  22.0    male   8000.0     mp
1    EMP002    sapna  21.0  female  60000.0  bihar
2    EMP003      ram  34.0    male  70000.0    NaN
3    EMP004  krishna  32.0    male      NaN  delhi
4    EMP005    seeta  43.0  female  40000.0   pune
5    EMP006    radha   NaN  female  50000.0  rachi
6    EMP007    mohan  26.0    male  66000.0    NaN
7    EMP008    shyam  29.0    male  45000.0  delhi
8    EMP009  hanuman  31.0    male  85000.0    goa
9   EMP0010    meena  29.0     NaN  80000.0  delhi
10   EMP002    sapna  21.0  female  60000.0  bihar
11   EMP004  krishna  32.0    male      NaN  delhi

In [29]:
print(data.duplicated())

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [30]:
print(data.duplicated().sum())

2

In [31]:
print(data["EMP_ID"].duplicated().sum())

2

In [35]:
print(data.drop_duplicates("EMP_ID"))

    EMP_ID     name   age  gender  sallary   city
0   EMP001   vikash  22.0    male   8000.0     mp
1   EMP002    sapna  21.0  female  60000.0  bihar
2   EMP003      ram  34.0    male  70000.0    NaN
3   EMP004  krishna  32.0    male      NaN  delhi
4   EMP005    seeta  43.0  female  40000.0   pune
5   EMP006    radha   NaN  female  50000.0  rachi
6   EMP007    mohan  26.0    male  66000.0    NaN
7   EMP008    shyam  29.0    male  45000.0  delhi
8   EMP009  hanuman  31.0    male  85000.0    goa
9  EMP0010    meena  29.0     NaN  80000.0  delhi

In [37]:
# WORKING WITH MISSING DATA IN PANDAS:-
print(data)

     EMP_ID     name   age  gender  sallary   city
0    EMP001   vikash  22.0    male   8000.0     mp
1    EMP002    sapna  21.0  female  60000.0  bihar
2    EMP003      ram  34.0    male  70000.0    NaN
3    EMP004  krishna  32.0    male      NaN  delhi
4    EMP005    seeta  43.0  female  40000.0   pune
5    EMP006    radha   NaN  female  50000.0  rachi
6    EMP007    mohan  26.0    male  66000.0    NaN
7    EMP008    shyam  29.0    male  45000.0  delhi
8    EMP009  hanuman  31.0    male  85000.0    goa
9   EMP0010    meena  29.0     NaN  80000.0  delhi
10   EMP002    sapna  21.0  female  60000.0  bihar
11   EMP004  krishna  32.0    male      NaN  delhi

In [38]:
print(data.isnull())

    EMP_ID   name    age  gender  sallary   city
0    False  False  False   False    False  False
1    False  False  False   False    False  False
2    False  False  False   False    False   True
3    False  False  False   False     True  False
4    False  False  False   False    False  False
5    False  False   True   False    False  False
6    False  False  False   False    False   True
7    False  False  False   False    False  False
8    False  False  False   False    False  False
9    False  False  False    True    False  False
10   False  False  False   False    False  False
11   False  False  False   False     True  False

In [39]:
print(data.isnull().sum())

EMP_ID     0
name       0
age        1
gender     1
sallary    2
city       2
dtype: int64

In [40]:
print(data.dropna())

    EMP_ID     name   age  gender  sallary   city
0   EMP001   vikash  22.0    male   8000.0     mp
1   EMP002    sapna  21.0  female  60000.0  bihar
4   EMP005    seeta  43.0  female  40000.0   pune
7   EMP008    shyam  29.0    male  45000.0  delhi
8   EMP009  hanuman  31.0    male  85000.0    goa
10  EMP002    sapna  21.0  female  60000.0  bihar

In [42]:
import numpy as np
print(data.replace(np.nan,"sapna"))

     EMP_ID     name    age  gender  sallary   city
0    EMP001   vikash   22.0    male   8000.0     mp
1    EMP002    sapna   21.0  female  60000.0  bihar
2    EMP003      ram   34.0    male  70000.0  sapna
3    EMP004  krishna   32.0    male    sapna  delhi
4    EMP005    seeta   43.0  female  40000.0   pune
5    EMP006    radha  sapna  female  50000.0  rachi
6    EMP007    mohan   26.0    male  66000.0  sapna
7    EMP008    shyam   29.0    male  45000.0  delhi
8    EMP009  hanuman   31.0    male  85000.0    goa
9   EMP0010    meena   29.0   sapna  80000.0  delhi
10   EMP002    sapna   21.0  female  60000.0  bihar
11   EMP004  krishna   32.0    male    sapna  delhi

In [43]:
print(data.replace(np.nan,30000))

     EMP_ID     name      age  gender  sallary   city
0    EMP001   vikash     22.0    male   8000.0     mp
1    EMP002    sapna     21.0  female  60000.0  bihar
2    EMP003      ram     34.0    male  70000.0  30000
3    EMP004  krishna     32.0    male  30000.0  delhi
4    EMP005    seeta     43.0  female  40000.0   pune
5    EMP006    radha  30000.0  female  50000.0  rachi
6    EMP007    mohan     26.0    male  66000.0  30000
7    EMP008    shyam     29.0    male  45000.0  delhi
8    EMP009  hanuman     31.0    male  85000.0    goa
9   EMP0010    meena     29.0   30000  80000.0  delhi
10   EMP002    sapna     21.0  female  60000.0  bihar
11   EMP004  krishna     32.0    male  30000.0  delhi

In [54]:
data["sallary"]=data["sallary"].replace(np.nan,30000.0)
print(data)

     EMP_ID     name   age  gender  sallary   city
0    EMP001   vikash  22.0    male   8000.0     mp
1    EMP002    sapna  21.0  female  60000.0  bihar
2    EMP003      ram  34.0    male  70000.0    NaN
3    EMP004  krishna  32.0    male  30000.0  delhi
4    EMP005    seeta  43.0  female  40000.0   pune
5    EMP006    radha   NaN  female  50000.0  rachi
6    EMP007    mohan  26.0    male  66000.0    NaN
7    EMP008    shyam  29.0    male  45000.0  delhi
8    EMP009  hanuman  31.0    male  85000.0    goa
9   EMP0010    meena  29.0     NaN  80000.0  delhi
10   EMP002    sapna  21.0  female  60000.0  bihar
11   EMP004  krishna  32.0    male  30000.0  delhi

In [49]:
print(data["sallary"].mean())

52000.0

In [52]:
 #data["sallary"]=data["sallary"].replace(np.nan,52000.0)
 #print(data)

     EMP_ID     name   age  gender  sallary   city
0    EMP001   vikash  22.0    male   8000.0     mp
1    EMP002    sapna  21.0  female  60000.0  bihar
2    EMP003      ram  34.0    male  70000.0    NaN
3    EMP004  krishna  32.0    male  30000.0  delhi
4    EMP005    seeta  43.0  female  40000.0   pune
5    EMP006    radha   NaN  female  50000.0  rachi
6    EMP007    mohan  26.0    male  66000.0    NaN
7    EMP008    shyam  29.0    male  45000.0  delhi
8    EMP009  hanuman  31.0    male  85000.0    goa
9   EMP0010    meena  29.0     NaN  80000.0  delhi
10   EMP002    sapna  21.0  female  60000.0  bihar
11   EMP004  krishna  32.0    male  30000.0  delhi

In [58]:
print(data.fillna(method="bfill"))

     EMP_ID     name   age  gender  sallary   city
0    EMP001   vikash  22.0    male   8000.0     mp
1    EMP002    sapna  21.0  female  60000.0  bihar
2    EMP003      ram  34.0    male  70000.0  delhi
3    EMP004  krishna  32.0    male  30000.0  delhi
4    EMP005    seeta  43.0  female  40000.0   pune
5    EMP006    radha  26.0  female  50000.0  rachi
6    EMP007    mohan  26.0    male  66000.0  delhi
7    EMP008    shyam  29.0    male  45000.0  delhi
8    EMP009  hanuman  31.0    male  85000.0    goa
9   EMP0010    meena  29.0  female  80000.0  delhi
10   EMP002    sapna  21.0  female  60000.0  bihar
11   EMP004  krishna  32.0    male  30000.0  delhi

C:\Users\sapna\AppData\Local\Temp\ipykernel_2808\1042730050.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))

In [59]:
print(data.fillna(method="ffill"))

     EMP_ID     name   age  gender  sallary   city
0    EMP001   vikash  22.0    male   8000.0     mp
1    EMP002    sapna  21.0  female  60000.0  bihar
2    EMP003      ram  34.0    male  70000.0  bihar
3    EMP004  krishna  32.0    male  30000.0  delhi
4    EMP005    seeta  43.0  female  40000.0   pune
5    EMP006    radha  43.0  female  50000.0  rachi
6    EMP007    mohan  26.0    male  66000.0  rachi
7    EMP008    shyam  29.0    male  45000.0  delhi
8    EMP009  hanuman  31.0    male  85000.0    goa
9   EMP0010    meena  29.0    male  80000.0  delhi
10   EMP002    sapna  21.0  female  60000.0  bihar
11   EMP004  krishna  32.0    male  30000.0  delhi

C:\Users\sapna\AppData\Local\Temp\ipykernel_2808\2373199802.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="ffill"))